In [54]:
import matplotlib.pyplot as plt
%matplotlib inline

In [55]:
import pandas as pd
import numpy as np

In [56]:
df = pd.DataFrame(np.random.randint(0, 10, size=(10, 2)), columns=list('ab'))

In [57]:
df

   a  b
0  6  9
1  3  5
2  1  0
3  6  8
4  4  3
5  3  8
6  6  7
7  1  9
8  5  7
9  7  6

In [58]:
df.loc[::2, 'a'] = np.nan

In [59]:
df

     a  b
0  NaN  9
1  3.0  5
2  NaN  0
3  6.0  8
4  NaN  3
5  3.0  8
6  NaN  7
7  1.0  9
8  NaN  7
9  7.0  6

In [60]:
df['c'] = df.a.combine_first(df.b)

In [61]:
df

     a  b    c
0  NaN  9  9.0
1  3.0  5  3.0
2  NaN  0  0.0
3  6.0  8  6.0
4  NaN  3  3.0
5  3.0  8  3.0
6  NaN  7  7.0
7  1.0  9  1.0
8  NaN  7  7.0
9  7.0  6  7.0

In [67]:
df['d'] = df.b.combine_first(df.a)

In [74]:
df.sort_values('b').sort_values('a')

     a  b    c    d
7  1.0  9  1.0  9.0
1  3.0  5  3.0  5.0
5  3.0  8  3.0  8.0
3  6.0  8  6.0  8.0
9  7.0  6  7.0  6.0
2  NaN  0  0.0  0.0
4  NaN  3  3.0  3.0
6  NaN  7  7.0  7.0
8  NaN  7  7.0  7.0
0  NaN  9  9.0  9.0

In [62]:
gr_by_c = df.groupby('c')

In [66]:
gr_by_c.hist

In [64]:
df1 = pd.DataFrame([[1, np.nan]])
df2 = pd.DataFrame([[3, 4]])

In [65]:
df1.combine_first(df2)

   0    1
0  1  4.0